In [1]:
print("hello")

hello

In [2]:
import pandas as pd

In [5]:
pd

In [ ]:
# numpy -> data structure ndarray(n dimensional array)
# pandas -> data structure - series , dataframe

In [ ]:
# series -> 1D labelled array
# DataFrame -> 2D labelled array

In [6]:
info = {
    "Name" : ["Rahul","Harshita","Anushka"],
    "CGPA" : [9.5,7.0,8.9]
}
df=pd.DataFrame(info)
print(df)

       Name  CGPA
0     Rahul   9.5
1  Harshita   7.0
2   Anushka   8.9

In [7]:
df

       Name  CGPA
0     Rahul   9.5
1  Harshita   7.0
2   Anushka   8.9

In [8]:
#series
s= pd.Series([1,2,3,4,5])
print(s)
print(type(s))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
# index of series
print(s[0])
print(s[2])

1
3

In [11]:
# index->postion  ,  labelled->named index(can be int, string,char,etc named but by default index named like 0,1)
s=pd.Series([23,24,25,26], index=["Adam","Eve","Bob","Charlie"])
print(s)

Adam       23
Eve        24
Bob        25
Charlie    26
dtype: int64

In [13]:
s=pd.Series([23,24,25,26], index=["Adam","Eve","Bob","Charlie"])
print(s)
print(s["Adam"])
print(s["Bob"])

Adam       23
Eve        24
Bob        25
Charlie    26
dtype: int64
23
25

In [14]:
s=pd.Series([23,24,25,26], index=["Adam","Eve","Bob","Charlie"])
print(s)
print(s[0])

Adam       23
Eve        24
Bob        25
Charlie    26
dtype: int64
23

C:\Users\Dell\AppData\Local\Temp\ipykernel_15344\3888488868.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

In [15]:
s=pd.Series([23,24,25,26], index=["Adam","Eve","Bob","Charlie"])
print(s)
print(s.index)  # all data is considered as objects,(homogenous)

Adam       23
Eve        24
Bob        25
Charlie    26
dtype: int64
Index(['Adam', 'Eve', 'Bob', 'Charlie'], dtype='object')

In [ ]:
#series properties
#1) homogenous
#2) vectorized operations
#3) handle missing values with NaN
#4) mutable values , immutable size

In [16]:
# vectorized operations( series properties)
s1= pd.Series([1,2,3,4,5])
s2= pd.Series([10,20,30,40,50])
print(s1+s2)

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [21]:
# mutable values , immutable size means values of series can be change but size of series would still be same
s1= pd.Series([1,2,3,4,5])
s2= pd.Series([10,20,30,40,50])
s1[0]=100
changed_s1=s1.drop(0)  #drop() does NOT modify the original Series , ðŸ‘‰ It returns a new Series
print(s1)
print(changed_s1)

0    100
1      2
2      3
3      4
4      5
dtype: int64
1    2
2    3
3    4
4    5
dtype: int64

In [28]:
# dataframe with dict
info={
    "Name" : ["Adam","Eve","Bob"],
    "Age" : [23,24,25],
    "GPA" : [9.5,8.6,7.2]
}
df=pd.DataFrame(info)
print(df)
df
print(type(df))
print(df.index)
print(df.columns)

   Name  Age  GPA
0  Adam   23  9.5
1   Eve   24  8.6
2   Bob   25  7.2
<class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'GPA'], dtype='object')

In [30]:
# creating dataframe with list of lists
import numpy as np
np_arr = np.array([[1,2,3],[4,5,6]])
df= pd.DataFrame(np_arr,columns=["A","B","C"])
print(df)

   A  B  C
0  1  2  3
1  4  5  6

In [33]:
# csv data
df=pd.read_json("employee_data.json")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [5]:
# csv data
df1=pd.read_csv("employee_data.csv")
print(df1,type(df1))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [40]:
pd

In [6]:
df1

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [7]:
#dataframe methods
print(df1.head())  # it prints starting 5 rows data

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000

In [8]:
df1.head()

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000

In [10]:
df1.tail() # last 5 rows data

   ID    Name  Age Department  Salary
5   6   Frank   29    Finance   50000
6   7   Grace   41         HR   82000
7   8  Hannah   26  Marketing   47000
8   9     Ian   35         IT   75000
9  10   Julia   30    Finance   60000

In [11]:
df1.tail(2) # last 2 rows data

   ID   Name  Age Department  Salary
8   9    Ian   35         IT   75000
9  10  Julia   30    Finance   60000

In [13]:
df1.sample() # prints any randow row value from daataframes

   ID Name  Age Department  Salary
4   5  Eva   38         IT   65000

In [14]:
df1.sample(4) # prints any random 4 values

   ID    Name  Age Department  Salary
0   1   Alice   25         HR   55000
6   7   Grace   41         HR   82000
3   4   David   45  Marketing   91000
7   8  Hannah   26  Marketing   47000

In [15]:
df1.head(3) # prints any 3 values from starting

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000

In [16]:
df1.info() # summary of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [22]:
df1.shape  #returns no. of rows and columns of data

(10, 5)

In [23]:
df1

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [24]:
df1.describe() # gives statistical information of numerical data

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

In [26]:
df1.columns

Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')

In [28]:
df1.nunique()

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64